# ── Required ──────────────────────────────────────────────────────────────────
brew "git"
brew "git-delta"
brew "lazygit"
brew "tmux"
brew "neovim"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "eza"
brew "starship"
brew "jq"
brew "stow"
brew "node"
brew "corepack"        # ya no viene con la fórmula node; shims de yarn/pnpm
brew "coreutils"       # gls, gcat, … sin el prefijo g con PATH ajustado

# ── Recommended ───────────────────────────────────────────────────────────────
brew "fd"              # fast find — lo usa nvim-telescope
brew "gh"              # GitHub CLI
brew "wget"
brew "zsh"
brew "zoxide"          # cd inteligente con historial
brew "mise"            # gestor de versiones de runtimes (node, python, ruby…)
brew "htop"
brew "tldr"            # man pages simplificadas
brew "tree"
brew "curl"
brew "awscli"          # AWS CLI v2
brew "caddy"           # servidor web estático del "scriptorium" (~/src/html)
cask "ghostty", args: { adopt: true }  # terminal; adopt: no falla si ya está instalado a mano
cask "tailscale-app"   # tailnet personal: acceso a la Raspberry desde cualquier red
cask "hammerspoon"     # triple Shift → foco a la sesión de Claude en Ghostty
# Nota: alerter (notificaciones macOS con detección de clic → foco a Ghostty) no
# tiene fórmula en Homebrew-core; lo baja install.sh de GitHub Releases a ~/.local/bin.
